Repository: RadoslavNikolov23/Work-Chronicle
Catalog: src/WorkChronicle/Resources/Localization/AppResources.*.resx
Languages: bg

source: Edit Schedule
bg: Редактиране на графика

source: Information
bg: Информация

source: No save schedule found!
bg: Не е намерен запазен график!

source: Delete selected schedule
bg: Изтрий избраният график

source: Load selected schedule
bg: Зареди избраният график

source: Enter shift cycle pattern:
bg: Въведи модел на смените:

source: Enter first shift:
bg: Избери първата смяна:

source: Select First Shift
bg: Избери първата смяна

source: Generate Schedule
bg: Създай график

source: Select Shift Pattern
bg: Изберете работен модел на смяна

source: Select Total Shift Hours:
bg: Избери общия брой часове за смяна:

# SelectStartingDayWorkCycle
source: Select the starting day of your work cycle:
bg: Избери първоначалния ден на работния график:

# SelectStartingTimeForDayShift
source: Select the starting time for the Day Shift:
bg: Избери началния час за дневната смяна:

# SelectStartingTimeForNigthShift
source: Select the starting time for the Night Shift:
bg: Избери началния час за нощната смяна

source: Settings
bg: Настройки

# CompensateSelectedShift
source: Compensate
bg: Компенсирай

# MarkSelectedShiftSickLeave
source: Sick Leave
bg: Болничен

# MarkSelectedShiftPaidUnpaidLeave
source: Paid/Unpaid Leave
bg: Платен/Неплатен Отпуск

# EditSelectedShift
source: Edit
bg: Редактирай

source: Save Schedule
bg: Запази работния график

source: Go Back to Main
bg: Върни се към началната страница

# WelcomeToTheWorkChronicle
source: Work Chronicle
bg: Работен дневник

source: Edit and Save Schedule
bg: Редактирай и Запази Работния график

# LoadaSavedSchedule
source: Select a saved schedule
bg: Избери запазен график

# CreateANewMonthSchedule
source: Create a month schedule
bg: Създай месечен график

source: Create a year schedule
bg: Създай годишен график

source: About the App
bg: Относно приложението

source: Home
bg: Начало

source: Help
bg: Помощ

source: Exit
bg: Изход

source: This shift is not in the current month.
bg: Смяната не е от текущият месец.

source: This is a rest day.
bg: Това е почивен ден.

# TextMessageThisIsACalendar
source: This is a calendar for the {0} {1}!
bg: Това е календара за {0} {1}!

# TextMessageTotalHoursAreForTheMonthAndWorkingHours
source: Your total hours for the month {0} are {1} hours , the working hours for that month are: {2} hours.
bg: Общото ви работно време за месец {0} е {1} часа, работното време за този месец е {2} часа.

# CalendarWorkScheduleFor
source: Work Schedule for {0} {1}
bg: Работен график за {0} {1}

source: Error
bg: Грешка

source: Please select a schedule.
bg: Моля, изберете работен график.

source: Schedule not found, please try again!
bg: Работният график не е намерен, моля опитайте отново!

source: Something went wrong, please try again!
bg: Нещо се обърка, опитайте отново!

source: Schedule deleted successfully!
bg: Работният график е изтрит усшено!

# YouHaveLoadedTheScheduleForThe
source: You have loaded the {0} schedule for the {1}.
bg: Заредихте работния график за {0} {1}!

source: Please select a valid work shift!
bg: Моля, изберете валидна работна смяна!

source: Day shift
bg: Дневна смяна

source: Day shift second
bg: Втора Дневна смяна

source: Night shift
bg: Нощна смяна

source: Night shift Second
bg: Втора Нощна смяна

# InA24HourdDayScheduleCantBeSelectedAsFirstShift
source: In a 24HourDay schedule, {0} can't be select as first shift, please select {1}.
bg: В 24-часов график, {0} не може да бъде избрана като първа, моля, изберете {1}.

# InADayDayScheduleCantBeSelectFirstShift
source: In a Day-Day schedule, {0} can't be select as first shift, please select {1}.
bg: В график „Дневна-Дневна“, {0} не може да бъде избрана като първа, моля, изберете {1}.

# AnErrorOccurredWhileCalculatingTheShifts
source: An error occurred while calculating the shifts. Try again!
bg: Възникна грешка при изчисляването на смените. Опитайте отново!

# PleaseSelectAScheduleFirst
source: Please select a work schedule first!
bg: Моля, изберете работен модел първо!

# LanguageChanged
source: Language
bg: Език

# TheAppLanguageHasBeenChanged
source: The app language has been changed to {0}. You need to restart the app again!
bg: Езика на приложението е променен на {0}. Трябва да рестартирате приложението отново!

# TheTotalShiftHoursMustBepositiveNumber
source: The total shift hours must be a positive number!
bg: Общия брой часове, трябва да е позитивно число!

source: You have no schedule for this month.
bg: Нямате график за този месец.

source: This is a rest day and it can't be compensated!
bg: Това е почивен ден и не може да бъде компенсиран!

# ThisIsASickLeaveDayAndItCantBeCompensated
source: This is a sick leave and it can't be compensated!
bg: Това е болничен и не може да се компенсира!

# ThisIsACompensatedSiftAndFirstMustBeConvertedToWork
source: This is a compensated shift and must first be converted to a working one in order to turned to sick leave.
bg: Това е компенсирана смяна и първо трябва да бъде превърната в работна, за да се прехвърли в болничен.

# ThisIsAPaidLeaveDayAndItCantBeCompensated
source: This is a paid leave and it can't be compensated!
bg: Това е платен отпуск и не може да се компенсира!

# SelectedShiftIsCompensated
source: The selected shift is compensated.
bg: Избраната смяна е компенсирана.

# SelectedShiftIsMarkedAsSickLeaveDay
source: The selected shift is marked as sick leave and saved!
bg: Избраната смяна се отбелязва като болничен и e запазена!

# SelectedShiftIsMarkedAsPaidUnpaidLeave
source: The selected shift is marked as in paid/unpaid leave and saved!
bg: Избраната смяна се отбелязва като платена/неплатена отпуска и e запазена!

# SelectedShiftIsWorkingShiftAgain
source: The selected shift is a working shift, again.
bg: Избраната смяна е работна отново.

# YourShiftHasBeenEditSaveItFirst
source: Your shift has been edited. If you don't want to lose the schedule create it first!.
bg: Вашата смяна е редактирана. Ако не искате да загубите графика, първо го създадете!

# YourShiftHasBeenCompensatedSaveItFirst
source: Your shift has been compensated. If you don't want to lose the schedule create it first!.
bg: Вашата смяна е компенсирана. Ако не искате да загубите графика, първо го създадете!

# YourShiftHasBeenMarkedAsSickLeaveSaveItFirst
source: Your shift has been marked on sick leave. If you don't want to lose the schedule create it first!
bg: Вашата смяна е отбелязана като болничен. Ако не искате да загубите графика, първо го създадете!

# YourShiftHasBeenEdit
source: Your shift has been edited and saved!
bg: Вашата смяна е редактирана и запазена!

# SomethingWentWrongGeneratedNewSchedule
source: Something went wrong, generate new schedule.
bg: Нещо се обърка, генерирайте нов график.

source: Schedule Exists
bg: Графикът съществува

# AScheduleForTheMonthAlreadyExistsToOverwrite
source: A schedule for the month {0} already exists. Do you want to overwrite it?
bg: Вече съществува график за месец {0}. Искате ли да го презапишете?

source: Your schedule has been saved.
bg: Графикът е запазен.

# HourMessageYouHaveHoursOfOvertime
source: You have {0} hours of overtime, you can choose which shift to compensate.
bg: Имате {0} часа извънреден труд, можете да изберете коя смяна да компенсирате.

# HourMessageYouHaveUnderTheTotalHoursForTheMonth
source: You have {0} hours under the total hours for the month.
bg: Имате {0} часа под общия брой часове за месеца.

source: Change Language
bg: Смени езика

source: Report a problem
bg: Докладвай проблем

# ChangeTheme
source: Theme
bg: Тема

source: Reminder
bg: Напомняния

source: Select Language
bg: Избери език

# AtThisMomentWorkHoursAvailableFrom2021To2026
source: At this moment work hours are available from the year 2021 up to 2026 (included).
bg: В момента са налични работни часове от 2021 до 2026 година (включително).

# AnErrorOccurredWhileCreatingYearSchedule
source: An error occurred while creating the year schedule. Try again!
bg: Възникна грешка при създаване на годишния графика. Опитайте отново!

# CreatingYearScheduleWillOverrideDeleteSavedMonthSchedulesForYear
source: Creating a year schedule will override and delete saved month schedules for the {0} year. Do you want to continue?
bg: Създаването на годишен график ще замени и изтрие запазените месечни графици за {0} година. Искате ли да продължите?

# YourWorkScheduleForTheYearHasBeenCreatedAndSaved
source: Your work schedule for the year {0} has been created and saved. You can check your month schedules in the Select saved schedules page.
bg: Вашият работен график за {0} година е създаден и запазен. Можете да проверите месечните си графици на страницата Избор на запазени графици.

# ThisShiftMarkedOnPaidLeaveMustFirstConvertedWorking
source: This shift is marked as on paid/unpaid leave and must first be converted to a working one in order to turned to sick leave.
bg: Тази смяна се отбелязва като платен/неплатен отпуск и първо трябва да се преобразува в работна, за да се превърне в отпуск по болест.

# ThisShiftMarkedSickLeaveCannotBeMarkedAsPaidLeave
source: This shift is marked as on sick leave and cannot be marked as on paid leave!
bg: Тази смяна се отбелязва като платен/неплатен отпуск и първо трябва да се преобразува в работна, за да се превърне в отпуск по болест.

# ThiShiftMarkedSickLeaveCannotMarkedPaidUnpaidLeave
source: This shift is marked as sick leave and cannot be marked as paid/unpaid leave!
bg: Тази смяна е отбелязана като болнична и не може да бъде отбелязана като платенн/неплатен отпуск!

# YourShiftHasBeenMarkedPaidUnpaidLeaveSaveItFirst
source: Your shift has been marked on paid/unpaid leave. If you don't want to lose the schedule save it first!
bg: Вашата смяна е отбелязана в платен/неплатен отпуск. Ако не искате да загубите графика, първо го запазете!

# TextMessageOutOfThoseHoursYouHaveHorusOnSickLeave
source: Out of those hours you have {0} hours reported as sick leave.
bg: От тези часове имате {0} часа отчетени като болничен.

# TextMessageOutToseHoursYouHaveHoursReportedPaidUnpaidLeave
source: Out of those hours you have {0} hours reported as paid/unpaid leave.
bg: От тези часове имате {0} часа, отчетени като платен/неплатен отпуск.

source: Day 24 Hour
bg: Дневна 24 часова

source: Day Day
bg: Дневна Дневна

source: Day Night
bg: Дневна Нощна

source: Day Night Night
bg: Дневна Нощна Нощна

source: Press back again to exit!
bg: Натиснете отново назад, за да излезете!

source: Prev/Next Month
bg: Пред/След Месец

source: Rest Day
bg: Почивен ден

source: Compensated
bg: Компенсиран

source: Sick Leave
bg: Болничен

# PaidUnpaidLeave
source: Paid/Unpaid
bg: Отпуска

# ThisWillDeleteTheScheduleDoContinue
source: This will delete the select schedule. Do you want to continue?
bg: Това ще изтрие избрания график. Искате ли да продължите?

source: English
bg: Английски

source: Bulgarian
bg: Български

# YourWorkScheduelForTheMonthHasBeenCreatedAndSaved
source: Your work schedule for the month {0} {1} has been created and saved. You can check your month schedule in the Select saved schedules page.
bg: Вашият работен график за месец {0} {1} е създаден и запазен. Можете да проверите месечният си график на страницата Избор на запазени графици.

# CreatingAMonthScheduleWillOverrideDeleteSavedMonthSchedule
source: Creating a month schedule will override and delete a saved month schedule for the selected month. Do you want to continue?
bg: Създаването на месечен график ще замени и изтрие запазен месечен график за избрания месец. Искате ли да продължите?
